---
kind: type
id: T:Autodesk.Revit.DB.ExportPatternKey
source: html/8e55a491-0886-37f5-b867-e4eea95276eb.htm
---
# Autodesk.Revit.DB.ExportPatternKey

A key used to represent an item stored in an ExportPatternTable .

## Syntax (C#)
```csharp
public class ExportPatternKey : IDisposable
```